{"basics":{"name":"Jakub Wisniewski","label":"Data Scientist","email":"jakwisn@gmail.com","phone":"+45 31 78 52 46","url":"https://linkedin.com/in/jakwisn","summary":"Skilled data scientist with expertise in AI and experience in researching and developing DS and ML solutions. Demonstrated leadership through academic and professional contributions, including research, mentorship, and organizing events. Upon graduation, I intend to leverage and further advance my skills in AI.","profiles":[{"network":"GitHub","username":"jakwisn","url":"https://github.com/jakwisn"}]},"work":[{"name":"SEB","location":"Copenhagen, Denmark","position":"Data Scientist","startDate":"2022-02-01","endDate":"Present","summary":"Developing data processing pipelines, machine learning models and AI for client-facing analytics tools.","highlights":["Developed payment data processing pipeline using SQL, Pandas, Numpy, and Scikit-learn that fed data into Neo4j database.","Created containerized applications with Docker, SQLite, and FastAPI hosted via Cloud Run on Google Cloud.","Trained and deployed time-series Prophet model on GCP with CI/CD pipeline.","Automated data scraping and upload using Selenium and BeautifulSoup.","Created interactive HTML reports and dashboards using Plotly and Highcharts.","Applied machine learning models for multiclass classification and anomaly detection using PyTorch.","Generated a series of annual report summaries using LLM and NoSQL database containing 30GB of text data."]},{"name":"MI2 DataLab","location":"Warsaw, Poland","position":"Research Software Engineer","startDate":"2020-03-01","endDate":"2022-02-01","summary":"Developed open-source tools for Explainable Machine Learning and managed a large medical imaging database.","highlights":["Developed and maintained R and Python open-source packages for Explainable ML and Fairness.","Created a large-scale database of medical DICOM images for research purposes.","Trained deep learning models written in PyTorch on a multi-GPU cluster using Slurm environment.","Created a text annotation tool in Dash to expedite radiologist collaboration.","Published articles and presented research at CVPR workshop and useR! 2021 conference."]}],"education":[{"institution":"Danmarks Tekniske Universitet","location":"Denmark, Copenhagen","studyType":"Master's","area":"Artificial Intelligence","startDate":"2023-02-01","endDate":"2025-02-01","summary":"Master's program focused on Artificial Intelligence and Data Science. Master thesis: 'AI based navigational support for obstetric ultrasound imaging"},{"institution":"Warsaw University of Technology","location":"Poland, Warsaw","studyType":"Bachelor's","area":"Data Science","startDate":"2018-10-01","endDate":"2022-02-01","summary":"Bachelor of Science degree in Data Science. Bachelor thesis: 'AI regulations database with the analytical user interface module' - supervised by P. Biecek"}],"skills":[{"name":"Programming","keywords":["Python","R","SQL (MySQL)","JavaScript","HTML/CSS"]},{"name":"Frameworks and Libraries","keywords":["Numpy","Pandas","PyTorch","Tensorflow","FastAPI","Plotly","Scikit-learn","Langchain","OpenCV","Mlflow","Weights&Biases","Dash","Selenium"]},{"name":"Other","keywords":["Git","Docker","Linux","LaTex","HPC","Slurm","Tableau","PowerBI","GCP","VS Code","PyCharm","NoSQL (Neo4j)"]}],"languages":[{"language":"English","fluency":"Proficient (CAE on level C2)"},{"language":"Polish","fluency":"Native"}],"volunteer":[{"organization":"Data Science Club","position":"President","summary":"Led data science projects, hosted industry talks and events, and promoted AI and data science within the academic community.","highlights":["Coordinated projects on AI applications in archeological scans.","Hosted Kaggle competitions, hackathons, and events for data science enthusiasts."]},{"organization":"Hackathon4Ukraine","position":"Co-organizer","summary":"Organized hackathon to create tech solutions for Ukrainian aid and raised 33,000 DKK for Polish Humanitarian Action."}],"projects":[{"name":"Python Course for PhD Biology Students","summary":"Conducted a commercial Python course covering language fundamentals, data manipulation, visualization, and machine learning.","startDate":"2020-01-01","endDate":"2020-12-31"},{"name":"MLinPL Conference Poster Presentation","summary":"Presented and won award for best poster at MLinPL conference.","date":"2020-11-01"}],"interests":[{"name":"Tennis","keywords":["Member of Lyngby Tennis Club"]}]}